import numpy as np

chrom=[1.2, 0.9669912804000212, 1.1646195640079988, 0.8113302052066035, 1.1920535865774, 1.170441484625091, 1.1984640247120961, 0.9151788541939252, 1.0577902454202237, 1.1116593841625229,
       1.2, 1.2, 0.9230889360351314, 1.167864039936671, 1.1453310880736598, 0.9264190839700875, 0.8109697425649974, 0.9615631671671249, 1.2, 1.2]
chromopt=chrom   ##这里给变量赋了chrom的值，希望它不变化
print(chromopt)

chrom1=chrom
for j in range(len(chrom1)):
    r3=np.random.rand(2)
    if r3[0]<0.8:
        chrom1[j]=chrom1[j]+(r3[1]-0.5)*2*0.4
        if chrom1[j]<0.5: chrom1[j]=0.5
        if chrom1[j]>1.2: chrom1[j]=1.2
            
chrom=list(chrom1)   ## 这里把chom给变化了

print(chromopt)    ##发现chromopt跟着变了

#
